{ "courseTitle": "The Course Project",
"slidesArray": [  
  {
    "textContent": "Ea eiusmod voluptate dolor culpa non officia do irure magna ex incididunt enim nostrud. Minim aliquip consectetur nulla ex. Tempor sit laborum voluptate in et magna ullamco eiusmod. Exercitation consectetur est tempor esse eu. Laboris nisi mollit anim exercitation ut do tempor ipsum exercitation. Tempor duis duis quis consectetur esse aliqua.",
    "paragraphs": 1,
    "picture": "http://placehold.it/320x240",
    "templateFile": "rota3",
    "subTitle": "Sunt magna pariatur qui consectetur labore adipisicing fugiat velit est enim.",
    "guid": "6703ebd9-e32f-4b93-a88d-bd48a5d13d12",
    "index": 0,
    "_id": "55e619d25f2af2938ffc8e5b"
  },
  {
    "textContent": "Ex nostrud magna adipisicing adipisicing laborum excepteur pariatur amet. Lorem velit aute est esse esse esse consequat nisi ipsum. Labore laboris enim cillum pariatur enim consectetur fugiat proident laborum cillum non non. In dolore ad cillum consectetur proident incididunt laboris consectetur ullamco. Officia magna non magna id duis anim exercitation consequat dolore veniam aliqua minim voluptate in. Et cupidatat amet eiusmod nisi veniam eu culpa aliqua. Est eu enim excepteur aliqua do ex.\n\nDolore qui veniam reprehenderit sunt mollit irure veniam. Laborum ipsum do sunt anim nulla ex nisi reprehenderit id eiusmod nisi. Consectetur sunt nisi dolore ullamco nostrud cupidatat fugiat reprehenderit dolor deserunt. Consequat enim exercitation adipisicing et ea ad exercitation.",
    "paragraphs": 2,
    "picture": "http://placehold.it/320x240",
    "templateFile": "ultimotemplate",
    "subTitle": "Dolor proident consectetur sit occaecat excepteur nostrud quis et officia duis aute incididunt et.",
    "guid": "9ac6227c-1b10-4e82-8de7-48f8bb787031",
    "index": 1,
    "_id": "55e619d2218778cd0ad0407b"
  },
  {
    "textContent": "Officia minim enim Lorem ut sunt. Deserunt do amet ad est nostrud mollit officia laboris eiusmod. Commodo deserunt sunt excepteur aliquip nisi. Veniam labore sunt commodo consectetur fugiat aute eu esse sint deserunt cillum aute anim anim. Enim proident sit Lorem duis dolore elit consectetur nulla consequat adipisicing duis.\n\nEiusmod magna ipsum magna Lorem deserunt adipisicing consectetur deserunt dolor tempor qui eu. Ipsum nostrud ad ipsum commodo duis. In sit fugiat incididunt et officia eu dolor magna cupidatat. Consequat mollit nulla enim veniam ut irure eiusmod magna incididunt esse eu cupidatat culpa laborum.",
    "paragraphs": 2,
    "picture": "http://placehold.it/320x240",
    "templateFile": "rota1",
    "subTitle": "Id consequat aute nisi laborum aliqua exercitation magna et ullamco consectetur aliquip qui sit est.",
    "guid": "0c85c41f-ba23-4fb5-9e2e-562c5ea09af6",
    "index": 2,
    "_id": "55e619d289c71a9e9cef5821"
  },
  {
    "textContent": "Qui duis ullamco laborum officia nisi pariatur eu aliqua. Sunt aliqua consectetur id voluptate cupidatat ullamco proident dolor mollit. Deserunt laboris ad mollit laborum aliqua aliquip consectetur est velit consectetur irure ex excepteur. Elit non ex fugiat proident. Mollit quis laboris id laboris tempor proident laboris cillum esse ut anim non proident. Esse laborum ad proident sit dolore aliquip fugiat ex amet officia ex. Voluptate eu laborum duis enim proident consectetur ipsum excepteur sit ullamco nisi dolor velit.",
    "paragraphs": 1,
    "picture": "http://placehold.it/320x240",
    "templateFile": "rota2",
    "subTitle": "Id ea sit nostrud nulla culpa anim sint.",
    "guid": "bc7224e9-2027-495a-ab66-735374a9d413",
    "index": 3,
    "_id": "55e619d20059df2dd0538eda"
  },
  {
    "textContent": "Incididunt est laborum dolore anim mollit eiusmod laborum incididunt consequat. Consectetur anim et do ex pariatur eiusmod. Lorem elit duis nostrud sit qui eiusmod cillum. Aute aliqua aliqua in laboris eu occaecat. Aliquip voluptate occaecat excepteur veniam sint est sint est commodo.\n\nCillum qui enim et non eiusmod deserunt consectetur ullamco duis. Nulla enim nostrud non ea. Laboris esse elit fugiat consectetur est tempor minim commodo velit. Pariatur anim ea esse est tempor voluptate anim ullamco non consequat labore mollit. Nostrud veniam ut ad minim velit velit incididunt velit laboris pariatur est duis esse non. Deserunt aute est culpa nostrud ea proident velit officia amet sit anim.",
    "paragraphs": 2,
    "picture": "http://placehold.it/320x240",
    "templateFile": "rota2",
    "subTitle": "Tempor aute eiusmod eiusmod in aliqua anim.",
    "guid": "24d713ca-7be8-486b-932c-36686459099d",
    "index": 4,
    "_id": "55e619d2d82fa517f01cff75"
  },
  {
    "textContent": "Proident cupidatat esse ea ut cupidatat excepteur dolore labore tempor id. Incididunt ullamco pariatur exercitation sint magna incididunt sit excepteur magna. Commodo aute aute anim veniam proident mollit est.\n\nEst esse ut reprehenderit ipsum officia aliquip. Ipsum magna sunt minim commodo incididunt est qui cillum proident cillum pariatur aute anim consequat. Culpa dolore quis est excepteur sit minim velit non quis pariatur ullamco amet ea. Incididunt duis cupidatat anim reprehenderit consequat. Velit minim ex adipisicing dolore sit excepteur incididunt ipsum. Eu aliquip duis quis amet do est adipisicing id in.",
    "paragraphs": 2,
    "picture": "http://placehold.it/320x240",
    "templateFile": "rota2",
    "subTitle": "Aliquip cupidatat aute adipisicing nostrud in non dolore deserunt ea veniam.",
    "guid": "cfa9df19-6d70-4703-8050-eb70791ce8c2",
    "index": 5,
    "_id": "55e619d221d7e37454018bee"
  },
  {
    "textContent": "Incididunt deserunt occaecat anim veniam aliqua magna. Ea fugiat qui excepteur voluptate do occaecat ea cupidatat anim. Aute minim esse sit do aute cupidatat ea voluptate elit ullamco laboris. Et eiusmod veniam ullamco sit. Cillum do aliqua culpa laborum culpa Lorem non. Nulla velit cupidatat dolor aliquip duis irure incididunt sit.\n\nDolor deserunt ad ex exercitation id non dolore pariatur fugiat. Enim cillum eu magna mollit officia voluptate tempor deserunt. Aliqua occaecat Lorem aliquip voluptate consectetur sunt officia velit sint qui. Pariatur aute sit eu ullamco culpa voluptate proident in.",
    "paragraphs": 2,
    "picture": "http://placehold.it/320x240",
    "templateFile": "rota2",
    "subTitle": "Irure tempor eiusmod quis irure nulla eiusmod in velit velit id officia id do.",
    "guid": "13599f48-9d5a-4d12-9522-cdfd8878fcb8",
    "index": 6,
    "_id": "55e619d28492c2a9d720b056"
  },
  {
    "textContent": "Amet qui veniam et ea commodo aliquip ex fugiat exercitation commodo. Ipsum ea fugiat sunt consequat ad ea cupidatat ea. Voluptate culpa adipisicing voluptate velit pariatur proident est commodo sunt. Enim velit anim dolore cupidatat laborum anim incididunt id elit do. Nulla cillum esse sunt id enim.",
    "paragraphs": 1,
    "picture": "http://placehold.it/320x240",
    "templateFile": "rota3",
    "subTitle": "Deserunt cupidatat sunt velit magna ut aute Lorem duis laborum eu in duis.",
    "guid": "f626f07b-b3ce-4dca-b5ef-e50e5a9d5fbf",
    "index": 7,
    "_id": "55e619d28520b4a21daa8890"
  },
  {
    "textContent": "Ea reprehenderit veniam adipisicing et occaecat cillum. Ipsum Lorem irure eu ullamco quis tempor minim cillum labore anim irure dolor tempor ad. In ex occaecat duis est magna. Ad eiusmod ipsum ex Lorem amet esse. Voluptate duis voluptate voluptate aliquip et. Cupidatat ipsum eu aliquip amet labore. Sit pariatur esse deserunt ut dolore.\n\nAd nostrud pariatur Lorem sint consectetur culpa irure cillum incididunt velit laboris elit ipsum tempor. Eiusmod duis deserunt consequat irure quis. Cillum anim aliquip exercitation velit quis occaecat. Officia quis do dolore anim reprehenderit. Culpa dolore reprehenderit tempor nisi excepteur cupidatat ea aliquip in. Veniam adipisicing ipsum cillum consequat. Esse labore eu minim officia et enim.",
    "paragraphs": 2,
    "picture": "http://placehold.it/320x240",
    "templateFile": "rota2",
    "subTitle": "Sint nulla excepteur aute fugiat.",
    "guid": "cc3db6de-3012-47a4-b2e9-f6d21ec93a52",
    "index": 8,
    "_id": "55e619d2e593607666f0f193"
  },
  {
    "textContent": "Aute nulla do esse incididunt consectetur ut proident dolor voluptate id quis proident cupidatat. Aliqua occaecat excepteur voluptate ipsum dolor ea anim laborum eu officia consequat velit. Velit sint minim fugiat labore velit dolore. Adipisicing quis velit tempor quis nisi quis deserunt. Anim amet sit est tempor irure occaecat adipisicing officia deserunt minim.",
    "paragraphs": 1,
    "picture": "http://placehold.it/320x240",
    "templateFile": "rota2",
    "subTitle": "Ea laboris culpa elit mollit.",
    "guid": "8bf5dd84-e5bc-4d6a-8949-61d6e90663db",
    "index": 9,
    "_id": "55e619d225e41d3daa8310c3"
  },
  {
    "textContent": "Reprehenderit proident commodo officia consequat. Voluptate aliqua in enim sint eu culpa enim do ut dolore eiusmod. Tempor officia ipsum officia consequat sit esse cupidatat.\n\nNon ipsum laborum quis mollit aliquip aliqua est tempor quis id ex sint. Reprehenderit occaecat dolore velit incididunt ex sint ut aliquip ipsum. Anim deserunt quis nostrud nostrud eu dolore qui id tempor dolore. Sunt sint mollit aute esse cillum consequat in irure nisi labore incididunt consectetur. Ex tempor labore duis id pariatur commodo do in ullamco non in amet esse officia. Labore voluptate enim est do consequat sint sit qui proident dolor aliquip.",
    "paragraphs": 2,
    "picture": "http://placehold.it/320x240",
    "templateFile": "rota11",
    "subTitle": "Consequat adipisicing dolor pariatur irure qui consequat eiusmod.",
    "guid": "0bd1da63-a8f1-4e53-bdcb-d509fded2497",
    "index": 10,
    "_id": "55e619d2a0410382a8e0ff19"
  },
  {
    "textContent": "Aliqua non id nisi mollit reprehenderit nulla exercitation culpa nostrud tempor anim magna. Laborum excepteur dolore eiusmod veniam dolor ullamco. Qui duis eu consequat elit minim enim deserunt qui ad dolor cillum ex dolore velit. Nulla incididunt consequat eiusmod occaecat dolore nisi cillum officia laborum cupidatat velit consequat voluptate.\n\nCillum sunt dolor laborum officia ea. Et nostrud amet ut sit eiusmod irure enim reprehenderit magna ea do laboris nisi sunt. Magna occaecat esse dolor adipisicing laboris et sint pariatur sit excepteur velit. Veniam consequat est do officia ad ipsum. Eiusmod sit reprehenderit eu nisi eu cupidatat laborum labore minim duis nostrud in veniam enim. Dolore ea enim amet qui nulla consequat culpa fugiat do eu occaecat. Dolore cillum reprehenderit nostrud voluptate fugiat commodo officia labore tempor do dolore.",
    "paragraphs": 2,
    "picture": "http://placehold.it/320x240",
    "templateFile": "rota2",
    "subTitle": "Sunt est incididunt qui qui ipsum dolor culpa voluptate ut velit nisi veniam reprehenderit.",
    "guid": "c733a652-4d00-4ae0-b0e3-cfef05d2113e",
    "index": 11,
    "_id": "55e619d2d4e98493db502ac8"
  },
  {
    "textContent": "Quis fugiat ex labore in adipisicing irure sit aliqua magna adipisicing. Adipisicing sit deserunt irure eu labore cupidatat. Eiusmod do labore mollit consectetur. Esse mollit sit quis nisi ut nulla veniam quis ipsum duis laborum eiusmod.\n\nNostrud commodo aute nostrud ullamco reprehenderit labore consectetur est irure. Nisi nostrud consectetur velit reprehenderit sint labore sit laboris et. Elit minim sint non sint deserunt velit adipisicing qui elit officia duis laboris sit. Ad sint tempor ex irure enim. Elit ea quis in sit ex laborum. Laborum cillum officia elit voluptate. Aliquip est elit minim elit ea minim amet nulla eiusmod Lorem.",
    "paragraphs": 2,
    "picture": "http://placehold.it/320x240",
    "templateFile": "rota3",
    "subTitle": "Magna dolor reprehenderit et nulla laboris est in ea ad.",
    "guid": "d5c01b3e-df5d-4119-8d10-7352c5fd907d",
    "index": 12,
    "_id": "55e619d2ca287df498a34452"
  },
  {
    "textContent": "Ad tempor duis ad amet incididunt ut aliqua eu nulla aliquip. Et nisi do in non adipisicing officia enim anim ut ex quis adipisicing. Est adipisicing sunt consequat proident occaecat sint amet esse duis. Minim incididunt quis aliqua veniam qui et quis nisi culpa consequat id nulla consectetur veniam.\n\nNostrud magna ea anim velit irure do irure ut do irure est nisi Lorem. Quis qui reprehenderit fugiat proident est excepteur nulla exercitation veniam. Mollit nulla ullamco duis sint nisi aliquip anim ut ipsum non. Non duis minim aute ullamco consectetur non ad.",
    "paragraphs": 2,
    "picture": "http://placehold.it/320x240",
    "templateFile": "rotanova",
    "subTitle": "Sint veniam tempor duis aliquip laborum aute ad.",
    "guid": "349ce41b-8a66-4805-9e42-d81543c52d1c",
    "index": 13,
    "_id": "55e619d28d3467bf7a731ece"
  },
  {
    "textContent": "Voluptate exercitation voluptate pariatur velit culpa nisi aliquip labore ad reprehenderit. Exercitation cillum cillum labore est ut id ea laborum incididunt do nostrud elit laboris minim. Qui occaecat laborum labore velit qui excepteur exercitation duis eiusmod magna duis cupidatat eiusmod enim. Fugiat irure nisi occaecat ipsum adipisicing labore culpa tempor ipsum in.\n\nDo ipsum ad occaecat velit anim laborum irure. Exercitation minim laborum sint pariatur voluptate. Ut eu Lorem ad commodo tempor dolor laboris adipisicing anim occaecat. Tempor eiusmod Lorem culpa sit esse dolor culpa dolor consequat. Anim ipsum exercitation reprehenderit nisi minim reprehenderit. Tempor irure aute duis pariatur.",
    "paragraphs": 2,
    "picture": "http://placehold.it/320x240",
    "templateFile": "rota1",
    "subTitle": "Dolore ex ut mollit ea pariatur adipisicing veniam ut.",
    "guid": "068bce10-95b5-4e5a-833d-2c3c5edbda89",
    "index": 14,
    "_id": "55e619d2d5c5c0c25d179e29"
  }
]}